"""自主課題"""

with open('user_list.csv') as f:
    
    x = []
    for line in f:
        x.append(line.split(","))
        
    x.pop(0)
        
    for i in x:
        if int(i[3]) >= 60 :
            print(i)


'''
実行結果

['田沢 英嗣', 'たざわ ひでつぐ', '男', '64', '京都府', '620-1444\n']
['石野 まさみ', 'いしの まさみ', '女', '79', '石川県', '920-2333\n']
['古谷 敏和', 'ふるたに としかず', '男', '69', '静岡県', '425-0000\n']
['成瀬 美智子', 'なるせ みちこ', '女', '61', '岐阜県', '503-0116\n']
['日野 ひろ子', 'ひの ひろこ', '女', '61', '福岡県', '819-1132\n']
['高田 花', 'たかだ はな', '女', '73', '岡山県', '701-2623\n']
['越智 さゆり', 'おち さゆり', '女', '74', '兵庫県', '678-0111\n']
['対馬 美和子', 'つしま みわこ', '女', '79', '東京都', '174-0044\n']
['大塚 結衣', 'おおつか ゆい', '女', '68', '大阪府', '567-0001\n']
['岩井 涼子', 'いわい りょうこ', '女', '68', '大阪府', '533-0023\n']
['尾形 由宇', 'おがた ゆう', '女', '72', '石川県', '920-3259\n']
['細谷 文世', 'ほそや ふみよ', '女', '70', '愛知県', '464-0852\n']
['益岡 恵梨香', 'ますおか えりか', '女', '62', '埼玉県', '362-0025\n']
['奥田 明慶', 'おくだ あきよし', '男', '72', '北海道', '099-3115\n']
['湯浅 早織', 'ゆあさ さおり', '女', '69', '岩手県', '023-0402\n']
['河原 ヒカル', 'かわはら ひかる', '女', '77', '千葉県', '298-0012']

'''
