"""課題1"""
# リストメソッドを9種類全て試して挙動を確認せよ。
L = [47, 16, 7, 77, 55, 67, 5, 36, 87, 61, 57, 80, 49, 85]
array = ["x","x"]
count = 0

L.append("x")
print(L)
count += 1

print(L.count("47"))

L.extend(array)
print(L)
count += len(array)

print(L.index(47))

L.insert(3, "x")
print(L)
count += 1

for i in range(count):
    L.remove("x")
print(L)

print(L.pop(1))

L.reverse()
print(L)

L.sort()
print(L)

L.clear()
print(L)


'''
実行結果

[47, 16, 7, 77, 55, 67, 5, 36, 87, 61, 57, 80, 49, 85, 'x']
0
[47, 16, 7, 77, 55, 67, 5, 36, 87, 61, 57, 80, 49, 85, 'x', 'x', 'x']
0
[47, 16, 7, 'x', 77, 55, 67, 5, 36, 87, 61, 57, 80, 49, 85, 'x', 'x', 'x']
[47, 16, 7, 77, 55, 67, 5, 36, 87, 61, 57, 80, 49, 85]
16
[85, 49, 80, 57, 61, 87, 36, 5, 67, 55, 77, 7, 47]
[5, 7, 36, 47, 49, 55, 57, 61, 67, 77, 80, 85, 87]
[]
'''
